In [2]:
!pip install pandas

Collecting pandas
  Using cached pandas-1.5.3-cp38-cp38-win_amd64.whl (11.0 MB)
Requirement already satisfied: numpy>=1.20.3 in c:\users\user\appdata\local\programs\python\python38\lib\site-packages (from pandas) (1.24.2)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\user\appdata\local\programs\python\python38\lib\site-packages (from pandas) (2.8.2)
Collecting pytz>=2020.1
  Using cached pytz-2022.7.1-py2.py3-none-any.whl (499 kB)
Requirement already satisfied: six>=1.5 in c:\users\user\appdata\local\programs\python\python38\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Installing collected packages: pytz, pandas
Successfully installed pandas-1.5.3 pytz-2022.7.1

WARNING: You are using pip version 21.1.1; however, version 23.0.1 is available.
You should consider upgrading via the 'c:\users\user\appdata\local\programs\python\python38\python.exe -m pip install --upgrade pip' command.

# Data Frame 基本操作

In [1]:
import pandas as pd

In [2]:
columns = ['Name', 'Height', 'Age'] # 先放欄位
df = pd.DataFrame(columns=columns) # 製作框架
df  # 產出表格(目前為空表格)

Empty DataFrame
Columns: [Name, Height, Age]
Index: []

In [3]:
df.loc[0] = ['Allen', 175, 22] # 把資料放進表格
df

    Name  Height  Age
0  Allen     175   22

In [4]:
df.loc[1] = ['Ted', 180, 25] # 把資料放進表格
df

    Name  Height  Age
0  Allen     175   22
1    Ted     180   25

In [5]:
df['Weight'] = [75, 80] # 新增欄位，並且要補上原先的資料
df

    Name  Height  Age  Weight
0  Allen     175   22      75
1    Ted     180   25      80

In [6]:
df.drop(['Weight'], axis=1) # 刪除指定欄位，1為方向
df

    Name  Height  Age  Weight
0  Allen     175   22      75
1    Ted     180   25      80

In [7]:
df = df.drop(['Weight'], axis=1) # 再次進行宣告，才會進行更新
df

    Name  Height  Age
0  Allen     175   22
1    Ted     180   25

In [8]:
df.drop(1) #刪除第一列
df

    Name  Height  Age
0  Allen     175   22
1    Ted     180   25

In [9]:
df = df.drop(1)
df

    Name  Height  Age
0  Allen     175   22

In [10]:
df.loc[1] = ['Ted', 180, 25]
df

    Name  Height  Age
0  Allen     175   22
1    Ted     180   25

In [11]:
df['Age'][1]     # 列印指定位置的資料

25

In [12]:
df['Age'][1] = 30   # 將指定位置的資料更新

C:\Users\Tibame_EX14\AppData\Local\Temp\ipykernel_7788\3797380116.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Age'][1] = 30   # 將指定位置的資料更新

In [13]:
df

    Name  Height  Age
0  Allen     175   22
1    Ted     180   30

In [14]:
df2 = df.copy()
df2['Age'][1] = 30

C:\Users\Tibame_EX14\AppData\Local\Temp\ipykernel_7788\2473401203.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['Age'][1] = 30

In [15]:
df['Age'] = 28   # 全部值更新

In [16]:
df

    Name  Height  Age
0  Allen     175   28
1    Ted     180   28

In [17]:
data = [                   # 將上方表格資料寫進新資料
    ['Jack', 175, 22],
    ['Mary', 180, 25]
]
df2 = pd.DataFrame(data=data, columns=columns) # 新增一表格
df2

   Name  Height  Age
0  Jack     175   22
1  Mary     180   25

In [18]:
df

    Name  Height  Age
0  Allen     175   28
1    Ted     180   28

In [19]:
df.append(df2)   # 合併二表格

C:\Users\Tibame_EX14\AppData\Local\Temp\ipykernel_7788\1204998671.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2)   # 合併二表格

    Name  Height  Age
0  Allen     175   28
1    Ted     180   28
0   Jack     175   22
1   Mary     180   25

In [20]:
pd.concat([df, df2]) # 另一合併寫法

    Name  Height  Age
0  Allen     175   28
1    Ted     180   28
0   Jack     175   22
1   Mary     180   25

In [21]:
df3 = pd.concat([df, df2])
df3

    Name  Height  Age
0  Allen     175   28
1    Ted     180   28
0   Jack     175   22
1   Mary     180   25

In [22]:
df3.reset_index()   # 將index重置

   index   Name  Height  Age
0      0  Allen     175   28
1      1    Ted     180   28
2      0   Jack     175   22
3      1   Mary     180   25

In [23]:
df3.reset_index(drop=True)

    Name  Height  Age
0  Allen     175   28
1    Ted     180   28
2   Jack     175   22
3   Mary     180   25

In [24]:
df3 = df3.reset_index(drop=True)
df3

    Name  Height  Age
0  Allen     175   28
1    Ted     180   28
2   Jack     175   22
3   Mary     180   25

# Series

In [26]:
df3['Name']

0    Allen
1      Ted
2     Jack
3     Mary
Name: Name, dtype: object

#series 為一維
#如果要合併series，index必須要一樣